tap "aws/tap"
tap "earthly/earthly"
tap "federico-terzi/espanso"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# GNU database manager
brew "gdbm"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Configurable talking characters in ASCII art
brew "cowsay"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Pack, ship and run any application as a lightweight container
brew "docker"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython", link: false
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab", link: false
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Audio and video processing tools
brew "libav"
# Create modern online books from Markdown files
brew "mdbook"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch"
# Run a Kubernetes cluster locally
brew "minikube"
# Command-line collection runner for Postman
brew "newman"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql"
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Launch your Python interpreter the lazy/smart way
brew "python-launcher"
# Interpreted, interactive, object-oriented programming language
brew "python@3.7"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# AWS SAM CLI 🐿 is a tool for local development and testing of Serverless applications
brew "aws/tap/aws-sam-cli"
# Cross-platform Text Expander written in Rust
brew "federico-terzi/espanso/espanso"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# E-books management software
cask "calibre"
# Free and open-source web browser
cask "chromium"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-fira-code"
# Game development engine
cask "godot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Email tracker, read receipt and spy pixel blocker plugin for Apple Mail
cask "mailtrackerblocker"
# Minimal installer for conda
cask "miniconda"
# Collaboration platform for API development
cask "postman"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimized for blind people
cask "rocket"
# Music streaming service
cask "spotify"
# RSS and Atom reader
cask "vienna"
# Multimedia player
cask "vlc"
# Screen capture tool for remote teams
cask "zappy"
